SamsungSNBControl/xml/GetImagingSettings.xml


POST /onvif/imaging_service HTTP/1.1

Content-Type: application/soap+xml;
charset=utf-8;
action="http://www.onvif.org/ver20/imaging/wsdl/GetImagingSettings"

Host: 119.202.84.99

Content-Length: 1020

Accept-Encoding: gzip, deflate



<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
	<s:Header>
		<Security s:mustUnderstand="1"
			xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<UsernameToken>
				<Username>admin</Username>
				<Password
					Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">spsac9juXgnNmeascGY3l9dXHGU=</Password>
				<Nonce
					EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">mURZco5qoEehUAr25FrunA0AAAAAAAAANQAuMAAAAAA=</Nonce>
				<Created
					xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2012-05-21T00:46:20.026Z</Created>
			</UsernameToken>
		</Security>
	</s:Header>
	<s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
		xmlns:xsd="http://www.w3.org/2001/XMLSchema">
		<GetImagingSettings xmlns="http://www.onvif.org/ver20/imaging/wsdl">
			<VideoSourceToken>bd449516-4c96-44a6-a163-3ad5981c09fd
			</VideoSourceToken>
		</GetImagingSettings>
	</s:Body>
</s:Envelope>
HTTP/1.1 200 OK

Status: 200 OK

Server: gSOAP/2.7

Content-Type:
application/soap+xml; charset=utf-8

Content-Length: 1669

Connection: close

Date: Mon, 21 May 2012 00:46:21 GMT



<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
	xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa5="http://www.w3.org/2005/08/addressing"
	xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#"
	xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
	xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
	xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
	xmlns:xop="http://www.w3.org/2004/08/xop/include" xmlns:tt="http://www.onvif.org/ver10/schema"
	xmlns:xmime="http://www.w3.org/2005/05/xmlmime" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
	xmlns:wsrf-bf="http://docs.oasis-open.org/wsrf/bf-2" xmlns:wstop="http://docs.oasis-open.org/wsn/t-1"
	xmlns:timg="http://www.onvif.org/ver20/imaging/wsdl" xmlns:ter="http://www.onvif.org/ver10/error">
	<SOAP-ENV:Header></SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<timg:GetImagingSettingsResponse>
			<timg:ImagingSettings>
				<tt:BacklightCompensation>
					<tt:Mode>OFF</tt:Mode>
					<tt:Level>1</tt:Level>
				</tt:BacklightCompensation>
				<tt:Brightness>50</tt:Brightness>
				<tt:ColorSaturation>50</tt:ColorSaturation>
				<tt:Exposure>
					<tt:Mode>AUTO</tt:Mode>
					<tt:Iris>0</tt:Iris>
				</tt:Exposure>
				<tt:Sharpness>12</tt:Sharpness>
				<tt:WideDynamicRange>
					<tt:Mode>ON</tt:Mode>
					<tt:Level>8</tt:Level>
				</tt:WideDynamicRange>
				<tt:WhiteBalance>
					<tt:Mode>AUTO</tt:Mode>
					<tt:CrGain>420</tt:CrGain>
					<tt:CbGain>448</tt:CbGain>
				</tt:WhiteBalance>
			</timg:ImagingSettings>
		</timg:GetImagingSettingsResponse>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>